In [2]:
import pandas as pd

In [3]:
dict1 = {"Name" : ["Tahir", "Zaman", "khan", "Zeeshan", "Qasam", "Manan", "Hamza"],"Marks" : [98,89,99,87,90,83,99], "Gender" : ["Male","Male","Male","Male","Male","Male","Male"]}


df1 = pd.DataFrame(dict1)
df1

      Name  Marks Gender
0    Tahir     98   Male
1    Zaman     89   Male
2     khan     99   Male
3  Zeeshan     87   Male
4    Qasam     90   Male
5    Manan     83   Male
6    Hamza     99   Male

In [4]:
df1.head(3)

    Name  Marks Gender
0  Tahir     98   Male
1  Zaman     89   Male
2   khan     99   Male

In [5]:
df1.tail(3)

    Name  Marks Gender
4  Qasam     90   Male
5  Manan     83   Male
6  Hamza     99   Male

In [6]:
df1.shape

(7, 3)

In [7]:
print("Number of rows", df1.shape[0])
print("Number of columns", df1.shape[1])

Number of rows 7
Number of columns 3

In [8]:
df1.info()

<class 'pandas.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      str
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      str
dtypes: int64(1), str(2)
memory usage: 300.0 bytes

In [9]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [10]:
df1.describe(include="all")

         Name      Marks Gender
count       7   7.000000      7
unique      7        NaN      1
top     Tahir        NaN   Male
freq        1        NaN      7
mean      NaN  92.142857    NaN
std       NaN   6.491753    NaN
min       NaN  83.000000    NaN
25%       NaN  88.000000    NaN
50%       NaN  90.000000    NaN
75%       NaN  98.500000    NaN
max       NaN  99.000000    NaN

In [11]:
df1

      Name  Marks Gender
0    Tahir     98   Male
1    Zaman     89   Male
2     khan     99   Male
3  Zeeshan     87   Male
4    Qasam     90   Male
5    Manan     83   Male
6    Hamza     99   Male

In [12]:
df1["Gender"].unique()

<StringArray>
['Male']
Length: 1, dtype: str

In [13]:
df1["Gender"].nunique()

1

In [14]:
df1["Gender"].value_counts()

Gender
Male    7
Name: count, dtype: int64

In [15]:
df1["Marks"] >= 90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [16]:
df1[df1["Marks"] >= 90]

    Name  Marks Gender
0  Tahir     98   Male
2   khan     99   Male
4  Qasam     90   Male
6  Hamza     99   Male

In [17]:
len(df1[(df1["Marks"]>=90)  &  (df1["Marks"]<=100)])

4

In [18]:
sum(df1["Marks"].between(90,100))

4

In [19]:
df1["Marks"].mean()

np.float64(92.14285714285714)

In [20]:
df1["Marks"].min()

np.int64(83)

In [21]:
df1["Marks"].max()

np.int64(99)

In [22]:
def halfMarks(x):
    return x/2

In [23]:
df1["Half_Marks"] = df1["Marks"].apply(halfMarks)

In [24]:
df1

      Name  Marks Gender  Half_Marks
0    Tahir     98   Male        49.0
1    Zaman     89   Male        44.5
2     khan     99   Male        49.5
3  Zeeshan     87   Male        43.5
4    Qasam     90   Male        45.0
5    Manan     83   Male        41.5
6    Hamza     99   Male        49.5

In [28]:
df1.drop(columns=["Half Marks"])

KeyError: "['Half Marks'] not found in axis"

In [26]:
df1

      Name  Marks Gender  Half_Marks
0    Tahir     98   Male        49.0
1    Zaman     89   Male        44.5
2     khan     99   Male        49.5
3  Zeeshan     87   Male        43.5
4    Qasam     90   Male        45.0
5    Manan     83   Male        41.5
6    Hamza     99   Male        49.5

In [30]:
df1["Male_Female"] = df1["Gender"].map({"Male":1, "Female":0})

In [31]:
df1

      Name  Marks Gender  Half_Marks  Male_Female
0    Tahir     98   Male        49.0            1
1    Zaman     89   Male        44.5            1
2     khan     99   Male        49.5            1
3  Zeeshan     87   Male        43.5            1
4    Qasam     90   Male        45.0            1
5    Manan     83   Male        41.5            1
6    Hamza     99   Male        49.5            1

In [32]:
df1.drop("Male_Female", axis=1)

      Name  Marks Gender  Half_Marks
0    Tahir     98   Male        49.0
1    Zaman     89   Male        44.5
2     khan     99   Male        49.5
3  Zeeshan     87   Male        43.5
4    Qasam     90   Male        45.0
5    Manan     83   Male        41.5
6    Hamza     99   Male        49.5

In [35]:
df1.drop(["Male_Female","Half_Marks"], axis=1)

      Name  Marks Gender
0    Tahir     98   Male
1    Zaman     89   Male
2     khan     99   Male
3  Zeeshan     87   Male
4    Qasam     90   Male
5    Manan     83   Male
6    Hamza     99   Male

In [36]:
df1

      Name  Marks Gender  Half_Marks  Male_Female
0    Tahir     98   Male        49.0            1
1    Zaman     89   Male        44.5            1
2     khan     99   Male        49.5            1
3  Zeeshan     87   Male        43.5            1
4    Qasam     90   Male        45.0            1
5    Manan     83   Male        41.5            1
6    Hamza     99   Male        49.5            1

In [37]:
df1.drop(["Male_Female","Half_Marks"], axis=1, inplace=True)

In [38]:
df1

      Name  Marks Gender
0    Tahir     98   Male
1    Zaman     89   Male
2     khan     99   Male
3  Zeeshan     87   Male
4    Qasam     90   Male
5    Manan     83   Male
6    Hamza     99   Male

In [39]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='str')

In [40]:
df1

      Name  Marks Gender
0    Tahir     98   Male
1    Zaman     89   Male
2     khan     99   Male
3  Zeeshan     87   Male
4    Qasam     90   Male
5    Manan     83   Male
6    Hamza     99   Male

In [41]:
df1.sort_values(by="Marks")

      Name  Marks Gender
5    Manan     83   Male
3  Zeeshan     87   Male
1    Zaman     89   Male
4    Qasam     90   Male
0    Tahir     98   Male
2     khan     99   Male
6    Hamza     99   Male

In [44]:
df1.sort_values(by="Marks", ascending=False)

      Name  Marks Gender
2     khan     99   Male
6    Hamza     99   Male
0    Tahir     98   Male
4    Qasam     90   Male
1    Zaman     89   Male
3  Zeeshan     87   Male
5    Manan     83   Male

In [47]:
df1[df1["Gender"] == "Male"][["Name", "Marks"]]

      Name  Marks
0    Tahir     98
1    Zaman     89
2     khan     99
3  Zeeshan     87
4    Qasam     90
5    Manan     83
6    Hamza     99